[Oreans]

&New = Fişier nou...
&Open... = Deschide...
&Save = Salvează
Save &As... = Salvează ca...
&Protect = Protejează
&Help = Ajutor
About... = Despre...
Demo Version = Versiune Demo
Save = Salvează

Options = Opţiuni
Application Information = Informaţii despre aplicaţie
Protection Options = Opţiuni de protecţie
Code Replace = Înlocuire cod
Virtual Machine = Maşină virtuală
Customized Dialogs = 
Advanced Options = Opţiuni avansate
XBundler = XBundler
Help = Ajutor
Registration = Înregistrare 
Trial Settings = Opţiuni evaluare
Hardware Lock = Lacăt hardware
Password Protection = Protecţie cu parolă 
Soft&ware = Software
&Customers = Clienţi
&License Manager = Manager licenţe 
&Managers = Manageri
&Project = Proiect
Tools = Instrumente
H&elp = Ajutor
&Contents = Conţinut
&About = Despre
Export Generators = Generatori export
&Software = Software
&License = Licenţă
Password = Parolă
Trial Extension = Extindere evaluare
&Exit = Ieşire
P&rotect = Protecţie
Open Project = Deschide proiect
New Project = Proiect nou
Save Project = Salvează proiect
Save Project As... = Salvează proiect ca...
Protect File = Protejează fişier
Dupli&cate = Duplicare
(Double click to select) = (dublu click pentru selecţie) 


Application = Aplicaţie
Version = Versiune
Input Filename = Fişier sursă
Output Filename = Fişier destinaţie
File Size = Mărime fişier
File Information = Informaţie fişier
Get from version info = Determină din informaţii fişier
File not found = Fişierul nu a fost găsit
Refresh = Reîmprospătare
Same as input = La fel ca sursa

Advanced Anti-Debugger = Anti-Debugger avansat
Enable Protection = Activează protecţia
Advanced API-Wrapping = API-Wrapping avansat
Anti Dumpers = Anti Dumpers
Entry Point Obfuscation = Entry Point Obfuscation
Anti-Patching = Anti Patch
None = Nimic
File Patching = Patch fişier
Compression = Compresie
Resources = Resurse
Monitor Blockers = Blocare monitoare
Files Monitors = Monitoare fişiere
Registry Monitors = Monitoare Registrz
Delphi/BCB Form Protection = Protecţie ferestre Delphi/BCB
Memory Guard = Protecţie memorie
Resources Encryption = Criptare resurse
VMWare/Virtual PC = VMWare/Virtual PC
Compatible = Compatibilitate
When Debugger Found = La detecţia unui Debugger 
Enable Encryption = Activează criptare
Display Message = Afişează mesaj
Exit Silently = Ieşire silenţioasă
Crash Application = Distruge aplicaţia
Metamorph Security = Securitate metamorfică
Ring-0 Protection = Protecţie Ring-0
(not available in DEMO) = (nu este disponibilă în DEMO)

Import = Import
Export = Export
Reset Messages = Resetare mesaje

Global Caption = Mesaj global
Debugger found = Debugger detectat
Monitor software found = Sofware de monitorizare detectat
Cracking tool found = Instrument pentru crack-uri detectat
File corrupted = Fişier corupt
(Not displayed in this version) = (Nu este afişat în această versiune)
Internal exception occured =  Excepţie internă detectată
Virtual Machine Detected = Maşină virtuală detectată


Enable CodeReplace Technology = Activează tehnologia CodeReplace
Functions to remove using the CodeReplace Technology: = Funcţii destinate înlocuirii folosind tehnologia CodeReplace
Assembly code inside function: = Cod de ansamblare în interiorul funcţiei:
Force simulation before protection = Forţează simulare înaintea protecţiei
Run with parameters = Porneşte fără parametrii
Start Simulation = Porneşte simulare

Virtual API-Wrapper = API-Wrapper Virtual
Imported DLLs: = Fişiere DLL importate:
Functions to Virtualize: = Funcţii destinate virtualizării:
API Virtualization Level: = Nivel de virtualizare API:
Processor Specifications = Specificaţii procesor
Processor Type: = Tip procesor:
Multiprocessor: = Multiprocesor:
Opcode Type: = Tip Opcode:
Dynamic Opcode: = Opcode dinamic:
VM Complexity: = Complexitate VM:
VM size (aprox): = Mărime VM (aproximativ):
Execution Speed: = Viteză execuţie:
Entry Point Virtualization = Virtualizare Entry Point
Multi Branch Technology = Tehnologie Multi Branch

Mutable CISC processor = Procesor CISC mutabil
Mutable RISC-64 processor = Procesor RISC-64 mutabil
Mutable RISC-128 processor = Procesor RISC-128 mutabil
Mutable CISC-2 processor = Procesor CISC-2 mutabil

Static opcodes = Opcode static
Metamorphic - Level 1 = Metamorfic - Nivel 1
Metamorphic - Level 2 = Metamorfic - Nivel 2
Metamorphic - Level 3 = Metamorfic - Nivel 3

Disabled = Dezactivat
20% Dynamic = 20% dinamic
40% Dynamic = 40% dinamic
60% Dynamic = 60% dinamic
80% Dynamic = 80% dinamic

Enable XBundler = Activează XBundler
Make files visible to OpenDialog = Permite vizualizarea fişierelor cu OpenDialog
Allow bundling from any directory = Permite împachetarea din orice director
AVI files support = Suport pentru fişiere AVI
Deleted extracted on exit = Şterge fişierele extrase la ieşire
Files to bundle: (drag files here) = Fişiere destinate împachetării: (trage fişiere aici)
XBundler Options = Opţiuni XBundler
Add File = Adaugă fişier
Delete File = Şterge fişier

Filename = Nume fişier
Write to disk? = Salvează pe disc ?
Extraction Path (if written to disk) = Cale extragere (dacă se scrie pe disc)


Encrypt Application = Criptează aplicaţia
Protect as DLL Plugin = Protejează ca plugin DLL
Protect DLL plugin = Protejează plugin DLL
Last Section Name = Numele ultimei secţiuni
.NET assemblies = Assembly-uri .NET
Active Context = Context activ
Enable support = Activează suport
Splash screen settings = Opţiuni Splash Screen
Mouse Click to proceed = Click pentru continuare
Display during a number of seconds = Afişează timp de un numit număr de secunde

This option will encrypt your protected application. You should never uncheck this option, only for debug purposes. = Această opţiunea criptează aplicaţia dumneavoastră. Nu ar trebui să dezactivaţi această opţiune, doar în cazul unei sesiune de debugging. 

Check this option only if your protected DLL will be used as plugin in third party software. = Activează această opţiune doar dacă DLL-ul protejat va fi folosit ca un plugin în software third party.

You can change the name of the last section added by Themida = Puteţi schimba numele ultimei secţiuni adăugate de Themida

This option should always be enabled to protect your .NET assemblies = Această opţiune ar trebui sa fie activată permanent pentru a vă proteja assembly-urile .NET

Support for Active Context based DLLs =  Suport pentru librării bazate pe Active Context

Select a BMP-8 image that will be displayed when your application is launched = Alegeţi o imagine BMP-8 ce va fi afişată când aplicaţia este pornită

The user must click in the Splash Screen to continue running the protected application = Utilizatorul trebuie să efectueze un click pe Splash Screen pentru a continua rularea aplicaţiei protejate

The splash screen will be displayed for a custom number of seconds before continue running the protected application = Splash Screen va fi afişat pentru un anumit număr de secunde înainte de a continua rularea aplicaţiei protejate

This option will enable Trial and Licensing protections in Ring-0, which will enhance the way that trial information is stored in the system. If you check this option, a device driver will be embedded and extracted automatically when your application runs. Notice that the Hardware ID is different if you enable or disable this option. = Această opţiune activează protecţia de licenţă şi evaluare în Ring-0 si îmbunătăţeşte modul în care informaţia referitoare la evaluare este salvată în sistem. Dacă bifezi această opţiune, un driver va fi introdus şi extras automat în momentul în care aplicaţia este pornită. Hardware ID va fi diferit daca activaţi sau dezactivaţi această opţiune.


Reading SDK Macros = Citire macro-uri SDK
Redirecting and Encrypting SDK Macros = Redirectare şi Criptare macro-uri SDK
Merging sections / Preparing PE Header = Lipire secţiuni / Pregătire header PE
Examining and Wrapping API Calls = Examinare şi împachetare apelări API 
Generating Unique SecureEngine Code = Generare cod unic SecureEngine
Linking SecureEngine Code with Application = Conectare cod SecureEngine cu aplicaţia
Generating Unique Virtual Machine = Generare maşină virtuală unică
Compressing Virtual Machine = Compresare maşină virtuală
Virtualizing VM / CodeReplace Macros = Virtualizare VM / macro-uri CodeReplace
Compressing Application and Resources = Compresare aplicaţie si resurse
Encrypting Application and Resources = Criptare aplicaţie şi resurse

Test Protected File = Testează fişier protejat
Protect = Protejează
Cancel = Anulare
Play sound when protection finishes = Redare sunet la terminarea protecţiei

This option supervises at any time if your application is running under any kind of debugger. = Această opţiune verifică permanent dacă aplicaţia este rulată sub un debugger.
This option avoids your application from being dumped from memory to disk even using the most advanced memory dumping tools = Această opţiune nu permite salvarea pe disc a aplicaţiei din memorie, chiar dacă se folosesc cele mai avansate instrumente de salvare a memoriei
This option removes and encrypts the entry point of your application, executing it from a secure place in memory = Această opţiune şterge şi criptează entrz point-ul aplicaţiei, executându-l dintr-o locaţie sigură în memorie
This option will keep your application resources fully encrypted against modifications = Această opţiune permite păstrarea resurselor aplicaţiei criptate complet
If you want that your application will run inside VMWare/VirtualPC you must check this option = Daca doriţi ca aplicaţia să ruleze sub VMWare/VirtualPC va trebui să bifaţi această opţiune
This option will wrap the APIs used in your application to avoid a possible reconstruction of your original application = Această opţiune va împacheta API-ul folosit de aplicaţie pentru a evita reconstrucţia aplicaţiei originale
This option detects if any modification is done to your protected application, either by a cracker or a virus = Această opţiune detectează dacă s-au efectuat modificări asupra aplicaţiei protejate, fie de către un virus sau de către un crack
This option will activate the internal Metamorph engine to generate multiples opcode mutations for a single block of code = Această opţiune activează motorul intern de metamorfism pentru a genera multiple mutaţii opcode pentru un singur bloc de cod
This option will protect your application against memory patching = Această opţiune va proteja aplicaţia împotriva patch-urilor de memorie
This option allows you to choose the desired option to perform when a debugger or cracking tool has been found in memory = Această opţiune permite selecţia unei opţiuni ce va fi executată în momentul depistării unui debugger sau a unui program crack în memorie
This option keeps your application code compressed meanwhile it is not executed = Această opţiune păstrează codul aplicaţiei compresat cât timp nu este executat
This option keeps the resources in your application fully compressed = Această opţiune păstrează resursele aplicaţiei compresate complet
This option will compress the SecureEngine code that is appended into your protected application = Această opţiune compresează codul SecureEngine care este adăugat aplicaţiei protejate
This option will detect/fool possible files monitors when your protected application is running = Această opţiune detectează şi păcăleşte eventualele monitoare de fişiere cât timp aplicaţia rulează
This option will detect/fool possible registry monitors when your protected application is running = Această opţiune detectează şi păcăleşte eventualele monitoare de regiştrii cât timp aplicaţia rulează
This option will protect your Delphi/BCB forms against reconstruction from memory. Note that this option is incompatible with some Delphi/BCB applications = Această opţiune protejează formele Delphi/BCB împotriva reconstrucţiei din memorie. Această opţiune este incompatibilă cu unele aplicaţii Delphi/BCB
Load your customized messages from a file = Încarcă mesajele customizate din fişier
Save your customized messages to a file = Salvează mesajele customizate în fişier
This list displays all the DLLs imported by your application = Această listă afişează toate librăriile importate de către aplicaţie
This list displays all the imported functions for the selected DLL. You can select which functions will be "virtualized" = Această listă afişează toate funcţiile importate pentru librăria selectată. Puteţi selecta funcţiile care vor fi "virtualizate"
You can import API names from a text file. The imported APIs will be virtualized in the current project = Puteţi importa numele funcţiilor API dintr-un fişier text. API-ul importat va fi virtualizat în proiectul curent
Select the maximun number of instructions to virtualize from your application entry point = Alegeţi numărul maxim de instrucţiuni care vor fi virtualizate de la entry point-ul aplicaţiei
This option will insert multiple conditional branch instructions inside your unique Virtual Machine, making it harder to analyze = 
You can save the current selected APIs into a text file to be imported by another project = Această opţiune va introduce instrucţiuni multiple de tip "conditional branch" în interiorul maşinii virtuale unice, pentru a complica analiza acesteia
Complexity level to emulate each wrapped API = Complexitatea nivelului de emulare a API-ului împachetat

Changes have been made. Do you want to save project? = S-au efectuat schimbări asupra proiectului. Doriţi să salvaţi proiectul ?
Save Changes = Salvaţi schimbările

*UNSAVED* = *MODIFICAT*
Invalid Project File. Please, recreate a new one = Fişier proiect invalid. Vă rugăm să creeaţi un alt fişier
Load Project = Încărcare proiect
You need XBundler .NET for your .NET application. Please contact info@oreans.com = Aveţi nevoie de XBundler .NET pentru aplicaţia dumneavoastră .NET. Vă rugăm să ne contactaţi la info@oreans.com
Sorry, Themida Standard cannot protect .NET files. You need to upgrade to Themida Professional for .NET support. Upgrade now? = Ne pare rău, Themida Standard nu poate proteja fişiere .NET. Trebuie sa faceţi un upgrade la Themida Professional pentru suport .NET. Doriţi să faceţi acest upgrade acum?
Save Project = Salvează proiect
Save Project As... = Salvează proiect ca ...
No file selected. Please select a file to protect (Input Filename) =  Nu aţi ales un fişier. Trebuie să alegeţi un fişier pentru protecţie (fişier sursă)
No Output file selected. Please select an Output file before protecting = Nu aţi ales un fişier destinaţie. Vă rugăm să alegeţi un fişier destinaţie pentru protecţie
File does not exists: = Fişierul nu există:
File is already protected/compressed: = Fişierul este deja protejat/compresat:
File has invalid macros insertion: = Fişierul conţine macro-uri invalide
Please, review your macros again = Vă rugăm sa revedeţi macro-urile
File cannot be accessed for protection: = Fişierul nu poate fi accesat pentru protecţie
Please select a new file to protect (Input Filename) = Vă rugăm să alegeţi un nou fişier pentru protecţie (fişier sursă)
File has not being simulated. Please simulate the file before protection or uncheck the "Force simulation before protecting" checkbox = Fişierul nu a fost simulat. Vă rugăm să simulaţi acest fişier înainte de protecţie sau să debifaţi opţiunea "Forţează simularea înainte de protecţie"
Open Input File = Deschide fişier sursă
The resources section in your application is empty. Themida needs to rebuild your application header. Proceed? = Secţiunea de resurse a aplicaţiei este goală. Themida trebuie să reconstruiască header-ul aplicaţiei. Continuaţi?
Rebuild Header = Reconstruire header
File is compressed or already protected: = Fişierul este deja compresat sau protejat
Your application seems to be in use or running in memory. Please, make sure to close it before proceeding = Aplicaţia este în funcţiune sau rulează în memorie. Vă rugăm să vă asiguraţi că aplicaţia este oprită înainte să continuaţi.
Error = Eroare
Your application header is incompatible with Themida. Do you want Themida to rebuild your application header? = Header-ul aplicaţiei este incompatibil cu Themida. Doriţi ca Themida să reconstruiască header-ul aplicaţiei ?
.NET limitation = Limitare .NET
Sorry, you cannot change the global message caption in demo version = Ne pare rău, nu puteţi să schimbaţi mesajul global în versiunea demonstrativă
Warning! The current CodeReplace macros are not valid for the selected file. CodeReplace macros removed = Atenţie! Macro-urile curente nu sunt valabile pentru fişierul selectat.
Warning = Atenţie
Warning! The current application is already protected/compressed. Do you still want to protect it? = Atenţie! Aplicaţia curentă este deja protejată/compresată.
File has a missing macro START or END: = Fişierul nu conţine un macro START sau END:
Please review your macros again = Vă rugăm să revedeţi macro-urile
File cannot be opened: = Fişierul nu poate fi deschis:
Make sure that other application is not using it = Vă rugăm sa vă asiguraţi că alte aplicaţii nu îl folosesc.
File to protect has an invalid PE header. Unable to inspect file = Fişierul care trebuie protejat conţine un header PE. Inspectarea fişierului nu este posibilă
File to protect contains one macro with few lines of code on it. Please review your macros again = Fişierul care trebuie protejat conţine un macro cu puţine linii de cod. Vă rugăm sa revizuiţi macro-urile
Sorry, the current version of Themida does not support CodeReplace in Visual Basic Pcode applications = Ne pare rău, această versiune a Themida nu suportă CodeReplace in aplicaţii Visual Basic care folosesc Pcode
Sorry, the current version of Themida does not support CodeReplace in .NET applications = Ne pare rău, această versiune a Themida nu suportă CodeReplace în aplicaţii .NET
Unable to find a function to add CodeReplace technology = Imposibilă detecţia unei funcţii necesare pentru a adăuga tehnologia CodeReplace
Run with parameters = Porneşte cu parametrii
Please enter the parameters = Vă rugăm sa introduceţi parametrii
Sorry, you cant disable that option in demo version = Ne pare rău, această funcţie nu poate fi dezactivată în versiunea demonstrativă
Messages exported to = Mesajele exportate către
Messages imported from = Mesajele importate din
Themida GUI Overview = Descriere interfaţă Themida
Protect Now = Protejează acum
SecureEngine Technology = Tehnologia SecureEngine
SecureEngine Macros = Macro-uri SecureEngine
Code Replace = Înlocuire cod
Software Updates = Actualizare software
What is XBundler = Ce este XBundler
Using XBundler = Mod de folosire XBundler

Scenarios for Using XBundler = Scenarii pentru folosirea XBundler
*** ERROR: Project file does not exist or invalid. (Exit code 1) *** = *** EROARE: Fişierul proiectului nu exista sau este invalid. (Cod ieşire 1) ***
*** ERROR: File to protect does not exist. (Exit code 2) *** = *** EROARE: Fişierul care trebuie protejat nu există. (Cod ieşire 2) ***
*** ERROR: File is already protected. (Exit code 3) *** = *** EROARE: Fişierul este deja protejat. (Cod ieşire 3) ***
*** ERROR: Error in SecureEngine macros. Please review them again. (Exit code 4) *** = *** EROARE: Eroare in macro-urile SecureEngine. Vă rugăm să le revedeţi. (Cod ieşire 4) ***
*** ERROR: File to protect cannot be opened. (Exit code 2) *** = *** EROARE: Fişierul care trebuie protejat nu poate fi deschis (Cod ieşire 2) ***
*** ERROR: The splash file seems do not have 256 colors. Only 256 BMP files will be displayed correctly. = *** EROARE: Fişierul Splash Screen nu conţine 256 culori. Doar poze BMP de maxim 256 culori vor fi afişate corect.
*** ERROR: The splash file seems to be a BMP compressed. Only non compressed BMP files will be displayed correctly. = *** EROARE: Se pare că fişierul Splash Screen este o poză BMP compresată. Doar fişierele BMP necompresate vor fi afişate corect.
Macros found: = Macro-uri detectate:
*** Fatal error while protecting file. (Exit Code 5) *** = *** Eroare fatală în momentul deschiderii fişierului (Cod ieşire 5) ***
*** ERROR: Cannot write protected file. Make sure the file is not in use. (Exit code 6) *** = *** EROARE: Nu se poate scrie fişierul protejat. Vă rugăm să vă asiguraţi că fişierul nu este folosit (Cod ieşire 6) ***
Generating Unique SecureEngine Code... = Generez cod unic SecureEngine...
Linking SecureEngine Code with Application... = Conectare între cod SecureEngine şi aplicaţie
done. = terminat.
Encrypting Application and Resources... = Criptare aplicaţie şi resurse...
Compressing Application and Resources... = Compresez aplicaţie şi resurse
Macros processed: = Macro-uri procesate:

processed: procesate:
Application successfully protected. = Aplicaţia protejată cu success.
Do you want to go to the order form Themida subscription plans? = Doriţi să accesaţi formularul de comandă pentru tipurile de abonament Themida ? 
No file selected. Please, select a file to protect (Input Filename) = Nu aţi ales un fişier. Vă rugăm sa alegeţi un fişier pentru protecţie (fişier sursă)
Question = Întrebare
-- Files to Bundle -- = -- Fişiere destinate împachetării --
The path of the file that you are inserting must be relative to: = Calea către fişierul pe care doriţi să îl introduceţi trebuie să fie relativ la:
All imported by ordinal! = Toate importate după număr!
Medium = Mediu
Normal = Normal
High = Puternic
Supreme = Foarte puternic
Extreme = Extrem
Highest = Ultra

This option is not enabled in DEMO version = Această opţiune nu este activată în versiunea DEMO
DEMO Restriction = Restricţii DEMO
The splash file seems do not have 256 colors. Only 256 BMP files will be displayed correctly. = Fişierul Splash Screen conţine o imagine cu un număr diferit de 256 culori. Doar imagini BMP de tip 256 culori vor fi afişate corect.
The splash file seems to be a BMP compressed. Only non compressed BMP files will be displayed correctly. = Se pare că fişierul Splash Screen este o imagine BMP compresată. Doar fişiere BMP necompresate vor fi afişate corect.
Sorry, Themida DEMO does not support RISC-128 processors = Ne pare rău, Themida DEMO nu suportă procesoare RISC-128.
Processor Type = Tip procesor
Sorry, Themida DEMO does not support Dynamic Opcodes = Ne pare rău, Themida DEMO nu suportă Opcode dinamic.
The file is never extracted to disk! = Fişierul nu este extras pe disc!
Select file/s to bundle = Alegeţi fişierele pentru împachetare
No file selected. Please, select a file to protect (Input Filename) = Nu aţi ales un fişier. Vă rugăm sa alegeţi un fişier pentru protejare (fişier sursă)
Last Modified: = Ultima modificare:
(Application header has been rebuilt by Themida) = (Header-ul aplicaţiei a fost reconstruit de către Themida)
File Type: Windows Standard Executable = Tip fişier: Executabil Standard Windows
File Type: Visual Basic Native Executable = Tip fişier: Executabil Visual Basic Nativ
File Type: Visual Basic PCode Executable = Tip fişier: Executabil Visual Basic PCode
File Type: Windows .NET Executable = Tip fişier: Executabil Windows .NET
File Type: MACROMEDIA Executable = Tip fişier: Executabil MACROMEDIA
File Type: PowerBuilder Application = Tip fişier: Executabil PowerBuilder
File Type: Excelsior JET Application = Tip fişier: Executabil Excelsior JET
File Type: Dynamic Link Library (DLL) = Tip fişier: Librarie încărcată dinamic (DLL)
File Type: OLE Control Extension (OCX) File = Tip fişier: Extensie control OLE (OCX)
File Type: Screensaver File = Tip fişier: ScreenSaver
File Type: Windows NT Service = Tip fişier: Service Windows NT
File Type: Borland Library = Tip fişier: Librărie Borland 
File Type: Linux Executable (ELF/i386) = Tip fişier: Executabil Linux (ELF/i386)
File Type: NT Device Driver = Tip fişier: Driver NT 

*** Protected with Code Virtualizer *** = *** Protejat cu Code Virtualizer ***
Virtual Machine Macro Functions: = Funcţii macro ale maşinii virtuale:
CodeReplace Macro Functions: = Funcţii macro CodeReplace:
CodeEncrypt Macro Functions: = Funcţii macro CodeEncrypt:
ClearCode Macro Functions: = Funcţii macro ClearCode:
Registered Macro Functions: = Funcţii macro înregistrate:
Unregistered Macro Functions: = Funcţii macro neînregistrate:
Read functions automatically = Citeşte funcţiile automat
Read functions from SDK = Citeşte funcţiile din SDK
File already protected/compressed. = Fişierul este deja protejat/compresat.
Error: There is a missing START or END in one of your macros. = Eroare: Lipseşte un START sau END dintr-un macro.
Error: Unable to open the selected file. File may be in use. = Eroare: Nu poate fi deschis fişierul selectat. Este posibil ca fişierul să fie folosit.
Error: Invalid PE header in selected file. = Eroare. Header PE invalid în fişierul selectat.
Error: The included code inside a macro is too small. = Eroare: Codul inclus în macro este prea mic.
Error: There are at least a nested VM macros. VM macros cannot be nested. = Eroare: Există cel puţin un macro VM recursiv.
Error: The selected file is not an x64 application. You need Themida x32 to protect that application. = Eroare: Fişierul ales nu este o aplicaţie x64. Aveţi nevoie de Themida x32 pentru a proteja aplicaţia.
Error: The selected file is an x64 application. You need Themida x64 Edition to protect that application. = Eroare: Fişierul ales nu este o aplicaţie x64. Trebuie să folosiţi Themida x32 pentru a proteja aplicaţia.
Project: = Proiect:
Select functions from MAP file = Alegeţi o funcţie din fişierul MAP
Read functions automatically = Citire automată a funcţilor
How many functions do you want to add? = Câte funcţii doriţi să adăugaţi?
OK = OK
Sorry, the required MAP file was not found. Please, generate a MAP file for your application = Ne pare rău, fişierul MAP nu a fost găsit. Vă rugăm să generaţi un nou fişier MAP pentru aplicaţia dumneavoastră
There are not functions to simulate. Please, insert some functions either manually or automatically = Nu există funcţii pentru simulare. Vă rugăm să introduceţi manual sau automat câteva funcţii
Simulator = Simulator
Information = Informatie
None = Nimic
Message = Mesaj
Customize Dialog = Modifică dialog
Close = Închide

Internal Protection Messages = Mesaje interne de protecţie
Trial/Registration Messages = Mesaje de înregistrare/evaluare
Will be displayed by WinLicense = Vor fi afişate de WinLicense
Displayed by SDK or not displayed = Afişate de SDK sau nu sunt afişate
Cannot update oreans.sys driver (admin rights) = Nu poate fi actualizat driver-ul oreans.sys (drepturi de administrare)
Cannot open oreans.vxd driver (already in use) = Nu poate fi deschis driver-ul oreans.vxd (în folosinţă)
Driver cannot be updated = Driver-ul nu poate fi actualizat
Computer needs to be reset to install driver = Calculatorul trebuie sa fie repornit pentru a instala driver-ul.
Cannot write oreans.vxd (already in use) = Fişierul oreans.vxd nu poate fi scris (în folosinţă)

Trial nag screen (reminder) = Ecran evaluare tip "nag" (reamintire)
Trial days expired = Număr de zile expirate
Trial executions expired = Număr de execuţii expirate
Trial date expired = Data evaluării expirată
Trial runtime expired = Timpul de evaluare expirat
Trial global time expired = Timpul global de evaluare expirat
Trial locked to different country = Evaluare blocată pe o ţară diferită
Trial extension key corrupted = Cheia de extindere a evaluării coruptă
No more trial extensions allowed = Nu sunt permise extensii suplimentare ale evaluării
Show registration info (only first time when registered) = Afişează informaţii despre înregistrare (doar în momentul înregistrării)
License days expired = Timpul acordat de licenţă expirat
License executions expired = Numărul de execuţii acordat de licenţă expirat
License date expired = Data licenţei expirate
License global time expired = Timpul global al licenţei expirat
License key corrupted = Cheia licenţei corupte
License locked to different machine = Licenţa este blocată pe un alt calculator
License without machine locking = Licenţa este fără blocare a maşinii
No more hardware changes allowed = Nu mai sunt permise schimbări ale configuraţiei hardware
Stolen license key = Cheia licenţei este furată
License is not expirable = Licenţa nu poate expira
License required to run = Licenţa necesară pentru rulare
Trial/Licensing Manager manipulated = Manager-ul de licenţiere/evaluare a fost alterat
Invalid user/password (for password dialog) = Combinaţie utilizator/parolă invalidă (pentru dialog-ul de autentificare)

This application(s) will run in trial/restricted mode, until registered. = Această aplicaţie va rula în mod evaluare/restricţionat, până la înregistrare
Days Expiration = Expirare zile
Date Expiration = Expirare data
Executions = Execuţii
Run Time (execution) = Timp rulare (execuţie)
Global Time = Timp global
days = zile
times = rulări
minutes = minute
Unlimited = Nelimitat
(For custom restrictions) = (Pentru restricţii customizate)
Trial Restrictions = Restricţii referitoare la evaluare
Clock Change = Schimbarea ceasului
Trial Extension = Extensii ale evaluării
Lock trial to user language = Blochează versiunea de evaluare pe limbajul utilizatorului
Allow trial period to be extended (with a valid key) = Permite extinderea perioadei de evaluare (folosind o cheie validă)
Extension Key distribution options = Opţiuni de distribuire a cheilor pentru extensie
With single file = Folosind un singur fişier
With Registry = Folosind Registry
Value Name = Numele valorii
Maximum Extensions = Numărul maxim de execuţii
Maximum extensions allowed = Numărul maxim de extensii

This option sets a trial period to a certain amount of days since the application is started for the first time = Această opţiune permite configurarea unei perioade de zile din momentul în care aplicaţia a fost pornită pentru prima dată
This option sets an exact date for the end of the trial period = Această opţiune permite configurarea unei date exacte pentru terminarea perioadei de evaluare
This option sets an exact number of executions allowed for an application = Această opţiune permite configurarea unui număr exact de execuţii permise
This option sets an exact amount of time (in minutes) that an application can stay in memory = Această opţiune permite configurarea unui număr exact de timp (în minute) în care aplicaţia poate fi rulată
This option sets an exact amount of total time (in minutes) that an application can run during all Windows® sessions = Această opţiune permite configurarea unui numar exact de timp total (în minute) în care aplicaţia poate rula în toate sesiunile Windows®
This option allows an application to run in trial mode without any restrictions added by WinLicense = Această opţiune permite rularea aplicaţiei în mod evaluare fără restricţiile adăugate de WinLicense
You can select how sensitive WinLicense will behave against clock changes. If for example, you select "1 day clock back", WinLicense will ignore if the clock has been turned back for 1 day. = Puteţi alege cât de senzitiv WinLicense va fi faţă de schimbările aduse asupra ceasului. Dacă, de exemplu, alegeţi "Cu o zi în urmă", WinLicense va ignora schimbarea ceasului cu o zi în urmă.
This option allows an application to be locked to specific country when it runs in trial mode = Această opţiune permite blocarea aplicaţiei pe o anumită ţară cât timp rulează în mod evaluare
This option allows you to extend the trial period of your application with special trial extension keys = Această opţiune permite extinderea perioadei de evaluare a aplicaţiei folosind chei speciale de extindere a evaluării
This option sets the name of a trial extension file to be searched by WinLicense when the application is being started = Această opţiune permite configurarea numelui fişierului de extensie a evaluării care va fi căutat de WinLicense în momentul în care aplicaţia va fi pornită
This option is used to allow distribution of extension keys as Windows® Registry key files = Această opţiune este folosită pentru a permite distribuirea a cheilor de extensie sub forma unor fisiere cu chei de Windows® Registry 
This option limits the amount of trial extensions that an application can be extended = Această opţiune limitează numărul de extensii ale evaluării 

Any clock change = Orice schimbare a ceasului
1 hour clock back = Cu o oră în urmă
1 day clock back = Cu o zi în urmă

This application(s) can be registered, with the presence of a valid key. = Această aplicaţie poate fi înregistrată, folosind o cheie validă.
License Keys Accepted = Cheile din licenţă acceptate
Types of accepted License Keys = Tipuri de chei de licenţă acceptate
Single file = Un singur fişier
Registry = Registry
Security Options = Opţiuni de securitate
Enable SmartActivate® System for user-side generated keys. = Activează SmartActivate® pentru chei generate la nivelul utilizatorului.
Allow only hardware dependent (locked) registrations. = Permite doar înregistrări care depind de hardware (blocate pe hardware)
Accept only temporary keys (that expire). = Acceptă chei temporare (care vor expira)
Application only runs when registered. (Requires a key to run) = Aplicaţia va funcţiona doar dacă este înregistrată (Necesită o cheie pentru a rula)
Clear trial info when registered. = Informaţiile de evaluare sunt şterse după înregistrare
License Key Signature = Semnătura licenţei
Level 1 = Nivel 1
Level 2 = Nivel 2
For professional and elegant licensing control, WinLicense offers the SmartActivate® System. This technology allows an application to be registered using SmartActivate® keys = Pentru un control elegant si profesional al licenţelor, WinLicense oferă sistemul SmartActivate®. Această tehnologie permite unei aplicaţii să fie înregistrată folosind chei SmartActivate®
This option restricts the use of registration keys to a specific computer. As each computer has an unique machine ID (processor type, hard disk and BIOS serial), WinLicense can lock a registration key to that specific machine = Această opţiune restricţionează folosirea unei chei de înregistrare la un calculator anume. Cum fiecare calculator are un identificator unic (tip procesor, hard disk si serial BIOS), WinLicense poate bloca o cheie de înregistrare pe un calculator anume
This option denies the use of "time unlimited" registration keys and forces WinLicense to accept only temporary registration keys = 
This option allows user to run an application only in the presence of a valid registration key. WinLicense will terminate the application if no key is found or if it is invalid = Această opţiune permite unui utilizator să folosească aplicaţia doar în prezenţa unei chei de evaluare valide. WinLicense va termina aplicaţia daca nu va găsi o cheie sau dacă această cheie este invalidă. 
The purpose of this option is to clear the trial information from a computer once an user receives a valid registration key and registers an application. If the user decides to remove the registration key or it expires, the trial period will restart from zero = Scopul acestei opţiuni este de şterge informaţiile referitoare la evaluare din calculator, în momentul în care utilizatorul primeşte o cheie de înregistrare validă. Dacă utilizatorul va îndepărta cheia sau dacă aceasta expira, perioada de evaluare va porni de la zero
This option allows you to select the signature level used by WinLicense to check that licenses for your applications are genuine = Aceasta opţiune permite configurarea nivelului de semnături folosit de WinLicense pentru a determina dacă licenţa aplicaţiei este adevarată

Enable Password Protection = Activează protecţia prin parolă
Password requirement = Cerinţele parolei
Password Action = Acţiunea parolei
Encrypt EXE using the password hash. = Criptează executabilul folosind hash-ul parolei.
On Normal / Trial Version = În cazul versiunii normale / de evaluare
On Registered Version = În cazul versiunii de înregistrare
Never ask for a password. = Nu întreba vreodată pentru o parolă.
I will ask for a password manually. = Voi întreba pentru o parolă manual.
Automatically, ask for a password only the first time. = Automat, întreabă parola doar prima dată.
Automatically, always ask for a password. = Automat, întreabă parola de fiecare dată.

Hardware Lock = Blocare hardware
Custom Hardware Items = Elemente hardware customizate
Hardware Items = Elemente hardware
All hardware items = Toate elementele hardware
CPU = Procesor
BIOS =  BIOS
MAC Address = Adresă MAC
HDD Serial = Serial HDD
Allowed CPU changes = Permite schimbări ale procesorului
Allowed BIOS changes = Permite schimbări ale BIOS-ului
Allowed NIC changes = Permite schimbări ale plăcii de reţea
Splash settings = Opţiuni Splash Screen

Keep Trial Running = Menţine versiunea de evaluare funcţională
Keep running = Menţine funcţională
Launch Application when Trial Expired = Porneşte aplicaţia când evaluarea expiră
Launch Application = Porneşte aplicaţia
Application Name: = Numele aplicaţiei:
Enable Custom Event = Activează evenimente customizate
Export Specific Generators = Exportă generatori specifici
Event Name: = Numele evenimentului:
Export Generators = Generatori Export
Custom Event = Evenimente customizate
This option will export a specific license generator when your application is being protected = Această opţiune va exporta un generator de licenţe specific în momentul în care aplicaţia este protejată 
This option will run an external application when the trial period in your application has expired. = Această opţiune va porni o aplicaţie externă în momentul în care perioada de evaluare a expirat.
You can define a custom event to exclude the initialization of several protected applications at the same time. This option is also suitable when your application is launched many times per minute. = Această opţiune defineşte un eveniment care exclude iniţializarea mai multor aplicaţii în acelaşi timp. Această opţiune este în acelaşi timp adecvată pentru detecţia rulării aplicaţiei de foarte multe ori în timp scurt.
Check this option if you want that your application continues running in trial mode if an invalid license key is present. =  Bifează această opţiune dacă doriţi ca aplicaţia sa ruleze în mod evaluare dacă este prezentă o cheie invalidă.
*** Demo Version *** = *** Versiune demonstrativă ***
Destroy Exports section = Distruge secţiunea Exports
This option will destroy the export table of your DLL control for maximum security = Această opţiune va distruge tabela de exporturi a controlului DLL pentru securitate maximă
Select specific functions from your DLL to handle each event = Alegeţi funcţiile specifice din DLL pentru a controla fiecare eveniment
DLL Control file = Fişierul de control DLL

Export specific generators to App. folder = Exportă generatorii specifici în directorul App.
Trial in debug mode (for testing purposes) = Versiunea de evaluare în mod debug (pentru testări)
Check this option if you want to create a custom license generator for your protected application. The generator will be created in a subfolder inside your application folder. = Activaţi această opţiune daca doriţi sa creeaţi un generator de licenţe pentru aplicaţia dumneavoastră protejată. Generatorul va fi creeat într-un director în directorul aplicaţiei.
Uncheck this option only when you are going to release your protected program. For testing purposes, leave this option checked to avoid storing unnecessary information in your system about your trial status. = Dezactivaţi această opţiune doar dacă doriţi să distribuiţi programul protejat. Pentru teste, lăsaţi această această opţiune bifată pentru a evita stocarea unor informaţii care nu sunt necesare în sistem, referitoare la starea evaluării.

&Add = Adăugare
&Edit = Editare
&Delete = Stergere
Name = Nume
Company = Companie
Total Customers: = Total clienţi:
New Customer = Client nou
Edit Customer = Editare client
Delete Customer = Ştergere client
Customers = Clienţi
Extra Details = Detalii suplimentare
Add Customer = Adaugă client
Update = Actualizare
Filename = Fişier
Version = Versiune
Total Software: = Total software:
Do you want to delete this software? = Doriţi să ştergeţi acest software?
Confirm = Confirmare
Add Software = Adaugă software
Edit Software = Editează software
Delete Software = Ştergere software
Duplicate Software = Software duplicat
(leave blank to use the same input and output filename) = (lăsaţi liber pentru a folosi acelaşi fişier de intrare si ieşire)
Input File Type = Tipul fişierului sursă 
License Unique Key = Cheie unică de licenţă
Trial Unique Key = Cheie unică de evaluare 
Password Unique Key =  Cheie unică a parolei
Windows Standard Executable (EXE) = Executabil standard Windows (EXE)
Dynamic Link Library (DLL) = Librărie conectabilă dinamic (DLL)
OLE Control Extension (OCX) = Extensie control OLE (OCX)
Windows .NET Executable = Executabil Windows .NET
Windows NT/XP Service = Service Windows NT/XP
Screensaver File (SCR) = Screensaver (SCR)
Copy Software = Copiază software
Reg Unique Key missing. Please, select one. = Cheia unică de înregistrare lipseşte. Vă rog să alegeţi altă cheie.
Software Manager = Manager software
Sofware name missing. Please, select one. = Numele software-ului lipseşte. Vă rog să introduceţi alt nume.
Reg Unique Key is too short. Please, select a new unique key. = Cheia unică de înregistrare este prea mică. Vă rog să introduceţi o noua cheie unică.
Trial Unique Key missing. Please, select one. = Cheia unică de evaluare lipseşte. Vă rog să introduceţi altă cheie.
Trial Unique Key is too short. Please, select a new unique key. = Cheia unică de evaluare este prea scurtă. Vă rog să introduceţi altă cheie.
Pass Unique Key missing. Please, select one. = Cheia unică a parolei lipseşte. Vă rog să introduceţi altă cheie.
Pass Unique Key is too short. Please, select a new unique key. = Cheia unică a parolei este prea scurtă. Vă rog să introduceţi altă cheie.
The software already exists in database. Please, choose a new software name or version. = Acest software este deja salvat în baza de date. Vă rog să alegeţi un alt nume sau altă versiune.
A new License Hash is going to be created. Previous generated licenses will not work if you create a new hash. Proceed? = 
Duplicated Software = Un nou hash al licenţei va fi creeat. Licenţele creeate anterior acestei schimbări nu vor mai funcţiona dacă creeaţi un nou hash. Continuaţi ?
File cannot be opened. Make sure the application is not running or being used. = Fişierul nu poate fi deschis. Vă rog să vă asiguraţi că aplicaţia este oprită.
Protection Error = Eroare de protecţie
Protect Error = Eroare de protejare
File is compressed or already protected. = Fişierul este compresat sau este deja protejat.
File has a missing macro START or END. Please correct this error before protecting. = Fişierul nu conţine un macro START sau END. Vă rog să corectaţi această eroare înainte de a continua.
File cannot be opened. Make sure that other application is not using it. = Fişierul nu poate fi deschis. Vă rog să vă asiguraţi că fişierul nu este folosit de altă aplicaţie.
File has an invalid PE header. Unable to protect. = Fişierul conţine un header PE invalid. Nu poate fi protejat.
File contains one macro with few lines of code on it. Please review your macros before protecting. = Fişierul conţine un macro conţinând un număr mic de linii de cod. Vă rog să revedeţi macro-urile înainte de protejare.
File seems to be in use. Please, close the file to proceed with protection. = Fişierul pare a fi folosit de altă aplicaţie. Vă rog să închideţi fişierul pentru a putea continua cu protecţia.
The splash file does not exist. = Fişierul Splash Screen nu există.
Splash = Splash Screen
The splash file seems do not have 256 colors. Only 256 BMP files will be displayed correctly. = Fişierul Splash Screen conţine un număr diferit de 256 culori. Doar imagini BMP cu 256 culori vor fi afişate corect.
The splash file seems to be a BMP compressed. Only non compressed BMP files will be displayed correctly. = Fişierul Splash Screen pare a fi compresat. Doar fişierele BMP necompresate sunt afişate corespunzător.
Do you want to cancel the protection process? = Doriţi să întrerupeţi procesul de protejare?
Cannot open file to protect for writing. Please, make sure that the file is not being used or running. Protection aborted. = Fişierul nu poate fi deschis pentru scriere. Vă rog să vă asiguraţi că fişierul nu este în folosire. Procesul de protejarea întrerupt.
Cannot write protected file to disk. Please, make sure you have write permits and enough space in your disc. = Nu se poate scrie fişierul pe disc. Vă rog să vă asiguraţi că aveţi drepturi de scriere şi că este suficient spaţiu liber pe disc. 
Sorry, the DEMO version of WinLicense only allows protection with trial/licensing in debug mode = Ne pare rău, această versiune DEMO a WinLicense permite protejarea doar în mod evaluare
WinLicense DEMO =WinLicense DEMO

&Add License = Adaugă licenţă
&Edit License = Editează licenţă
&Delete License = Şterge licenţă
Create License Key = Creează cheie licenţă
Mark as Stolen = Notează cheia furată
Unmark Stolen = Denotează cheia
Stolen = Furate
Ban Hardware IDs = Blochează ID-urile hardware
Please make a selection... = Vă rog să faceţi o selecţie
License Details = Detalii licenţă
License Generation = Generare licenţă
Hardware ID = ID hardware
Custom Data = Date customizate
Key Type = Tip cheie
Country Locking = Blocare ţări
Store generated Licenses in folder: = Salvează licenţele generate în director:
Generate File Key = Generare cheie în fişier
Generate Registry Key = Generare cheie Registry
Generate Text Key = Generare cheie Text
Generate SmartActivate Key = Generare cheie SmartActivate

Total Software: = Software total:
All = Toate
Please make a selection... = Vă rog să faceţi o selecţie
Nothing selected. = Nu este nimic selectat.
Selection: = Selecţie:
Software: = Software:
Do you want to mark the current key as stolen? = Doriţi să marcaţi această cheie ca furată?
Stolen Keys = Chei furate
Do you want to unmark the current key from being stolen? = Doriţi să demarcaţi această cheie ?
Do you want to delete this license? = Doriţi să ştergeţi această cheie?
Warning: The generated keys will have the settings from the current project. Proceed? = Atenţie: Cheile generate vor avea configuraţia proiectului curect. Continuaţi ?
Generate License = Generare licenţă
Cannot create directory: = Nu se poate creea directorul:
Please, select which type of license you want to generate = Vă rugăm să alegeţi tipul de licenţă pe care doriţi să îl generaţi
Keys successfully generated in folder: = Cheile generate cu succes în directorul:
Please, first select a valid application to protect = Vă rog să alegeţi o aplicaţie validă pentru protejare
Ban Hardware Id = Blochează ID hardware

License Restrictions = Restricţii licenţă
Customer = Client
Software = Software
Save = Salvează
Edit License = Editare licenţă
Add License = Adaugă licenţă
Please, select a customer from database. = Vă rog să alegeţi un client din baza de date.
License Manager = Manager licenţe
Please, select a software from database. = Vă rog să alegeţi un pachet software din baza de date.
Please, insert a Hardware ID for verification = Vă rog sa alegeţi un ID hardware pentru verificare
The inserted Hardware ID is valid = ID-ul hardware introdus este valid
Invalid Hardware ID inserted = ID-ul hardware introdus este invalid
Another instance of WinLicense is running = O altă instanţă a WinLicense funcţionează în acest moment
You have enabled SmartActivate keys but you have not selected any type of License Keys accepted (Single file or Registry) Remember that you have to use WLRegSmartKeyInstallToFile or WLRegSmartKeyInstallToRegistry to finally install the SmartActivate key = Aţi activat chei SmartActivate dar nu aţi ales un tip de chei suportate (fişier sau Registry). Vă rog să ţineţi minte că trebuie să folosiţi WLRegSmartKeyInstallToFile sau WLRegSmartKeyInstallToRegistry pentru instalarea finală a cheiei SmartActivate
File has not being simulated: = Fişierul nu a fost simulat:
Please simulate the file before protection or uncheck the "Force simulation before protecting" checkbox = Vă rog să simulaţi acest fişier înainte de protejare sau să debifaţi opţiunea "Forţează simularea înainte de protejare"
Warning: Your application has been set up to be registered with a valid license key, but you have not selected any way of registration. If you continue, your application will not be able to be registered. Proceed? = Atenţie: Aplicaţia a fost configurată să fie în înregistrată cu o cheie validă  dar nu aţi ales o metodă valabilă de înregistrare. Dacă veţi continua, aplicaţia nu va putea fi înregistrată.
Warning: Your application has been set up to be extended with trial extension key, but you have not selected any way to extend the trial period. If you continue, your application will not be able to be extended. Proceed? = Atenţie: Aplicaţia dumneavoastră a fost configurată să accepte extinderea evaluării prin fişiere de extindere a licenţei dar nu aţi ales un mod prin care să se extindă perioada de evaluare. Dacă veţi continua, extinderea evaluarii aplicaţiei nu va fi posibilă. Continuaţi?
Your application header is incompatible with WinLicense. Do you want WinLicense to rebuild your application header? = Header-ul aplicaţiei este incompatibil cu WinLicense. Doriţi ca WinLicense să reconstruiască header-ul aplicaţiei? 
Sorry, WinLicense Standard cannot protect .NET files. You need to upgrade to WinLicense Professional for .NET support. Upgrade now? = Ne pare rău, WinLicense Standard nu suportă fişiere WinLicense. Va trebui să faceţi o actualizare către WinLicese Professional pentru suport .NET. Doriţi să faceţi o actualizare acum?
Note: CodeReplace has been added into your application = Notă: CodeReplace a fost adaugat în aplicaţia dumneavoastră
(Application header has been rebuilt by WinLicense) = (Header-ul aplicaţiei a fost reconstruit de WinLicense) 
Error: The selected file is not an x64 application. You need WinLicense x32 to protect that application. = Eroare: Fişierul ales nu este o aplicaţie x64. Aveţi nevoie de WinLicense x32 pentru a proteja aplicaţia.
Error: The selected file is an x64 application. You need WinLicense x64 Edition to protect that application. = Eroare: Fişierul ales este o aplicaţie x64. Aveţi nevoie de WinLicense x64 pentru a proteja aplicaţia.
Sorry, the MAP file was not found: = Ne pare rău, fişierul MAP nu a fost găsit:
Please, generate a MAP file for your application = Vă rog să generaţi un fişier nou pentru aplicaţie
Sorry, the current version of WinLicense does not support CodeReplace in Visual Basic Pcode applicaitons = Ne pare rău, versiunea curentă a WinLicense nu suportă CodeReplace în aplicaţii Visual Basic Pcode
Sorry, the current version of WinLicense does not support CodeReplace in .NET applications = Ne pare rău, versiunea curentă a WinLicense nu suportă CodeReplace în aplicaţii .NET.
There are some functions highly executed and some not executed in simulation. Do you want to unselect those functions? = Există funcţii executate des şi câteva funcţii care nu sunt executate în simulare. Doriţi să alegeţi aceste funcţii?
There are some functions highly executed in simulation. Do you want to unselect those functions? = Există câteva funcţii care sunt executate des în simulare. Doriţi să deselectaţi aceste funcţii ?
There are some functions not executed in simulation. Do you want to unselect those functions? = Există câteva funcţii care nu sunt executate în simuare. Doriţi să deselectaţi aceste funcţii?
Messages exported to: = Mesajele au fost exportate în:
Messages imported from: = Mesajele au fost importate în:
WinLicense GUI Overview = Revizuire interfaţă WinLicense
Trial Settings = Configuraţie evaluare
Trial SDK = SDK evaluare
Registration SDK = Înregistrare SDK
Password Protection = Protejare cu parolă
Miscellaneous SDK = SDK diverse
Hardware Lock = Blocare hardware
WARNING: Protected in Trial Debug Mode = Atenţie: Protejat în mod Evaluare Debug
Click and select here = Click aici pentru selecţie
ERROR: None of the functions handlers where specified in DLL Control = Eroare: Nu aţi specificat handlere de funcţii în fişierul de control DLL
Sorry, WinLicense DEMO does not support RISC-128 processors = Ne pare rău, această versiune demonstrativă a WinLicense nu suportă procesoare RISC-128
Sorry, WinLicense DEMO does not support Dynamic Opcodes = Ne pare rău, această versiune demonstrativă a WinLicense nu suportă OpCode dinamic.
Signature Level 2 is not accepted for the current Software. Please, go to the Sofware Panel and re-create a new License Hash for your software = Semnăturile Nivel 2 nu sunt acceptate pentur acest software. Vă rugăm să accesaţi panoul de control şi să recreeaţi un nou hash din licenţă pentru software
.NET Module = Modul .NET
File has a missing macro START or END. Please review your macros again: = Fişierul nu conţine un macro START sau END. Vă rugăm să revizuiţi macro-urile din aplicaţie:
File cannot be opened. Make sure that other application is not using it: = Fişierul nu poate fi deschis. Vă rugăm să vă asiguraţi că alte aplicaţii nu îl folosesc: 
File has an invalid PE header. Unable to inspect file: = Fişierul conţine un header PE invalid. Fişierul nu poate fi inspectat:
File contains one macro with few lines of code on it. Please review your macros again: = Fişierul conţine un macro cu un număr mic de linii de cod. Vă rugăm să revedeţi macrourile din aplicaţie:
Deep file analysis in progress = Analiză complexă a fişierului în progres
File analysis in progress = Analiza fişierului în progres
Please wait... = Vă rugăm aşteptaţi...
Analyzing CodeReplace macros = Analizez macro-uri CodeReplace
Are you sure you want to remove the selected Hardware ID? = Sunteţi sigur ca doriţi să ştergeţi ID-ul hardware selectat?
List of Banned  Hardware IDs: = Listă cu ID-uri hardware blocate:
Add = Adaugă
Remove = Şterge
Done = Terminat
Generating License Hash = Generez hash licenţă
Generate Password = Generează parolă
Password Generation = Generare parolă
Store generated Passwords in folder: = Salvează parolele generate în directorul:
Total Passwords: = Total parole:
Do you want to delete the selected record? = Doriţi să ştergeţia această înregistrare?
Password file generated in folder: = Fişierul cu parole generat în directorul:
Password Generator = Generator parole
Password Manager = Manager parole
Details = Detalii

Add Password = Adaugă parole
Edit Password = Editează parole
Please, select a customer to generate the password = Vă rugăm să alegeţi un client pentru a genera parola
Please, select a software to generate the password = Vă rugăm sa alegeţi un pachet software pentru a genera parola
Rolling back your actions = Anulez acţiunile dumneavoastră

Generate Extension = Generează extensie
Level = Nivel
Trial Extension Generation = Generează extensie a evaluării
Store generated Extensions in folder: = Salvează extensiile generate în director:
Generate File Key = Generează fişier cheie
Generate Registry Key = Generează cheie Registry
Trial extension key/s generated in folder: = Cheile de extensie a evaluării salvate în:
Trial Extension Generator = Generator extensii evaluare
Edit = Editează
Add Trial Extension = Adaugă extensie evaluare
Edit Trial Extension = Editează extensie evaluare
Please, select a software to generate the trial extension = Vă rog să alegeţi un produs software pentru a genera o extensie a evaluării

Warning: Trial in Debug Mode = Atenţie: Versiune de evaluare în mod Debug
Debug Mode Trial = Mod evaluare Debug
The application that you are going to protect will not include the SecureEngine Trial Storing Manager*. = Aplicaţie pe care doriţi să o protejaţi nu va include manager-ul de stocare a evaluărilor SecureEngine.
The trial information will be stored under the registry key: = Informaţiile despre evaluare vor fi stocate sub următoarea cheie din Registry:
(You can access to that key to reset/test the WinLicense Trial Engine) = (Puteţi accesa cheia pentru a reseta/testa motorul de evaluări WinLicense)
*To enable the SecureEngine Trial Storing Manager, uncheck the option "Trial in debug mode" in the Protect screen. = * Pentru a activa manager-ul de stocare a evaluărilor SecureEngine, debifaţi opţiunea "Evaluare în mod Debug"
Don't show this screen again = Nu mai afişa acest ecran

Do you want to delete the selected client? = Doriţi să ştergeţi acest client?
Enter new Hardware ID to ban: = Introduceţi un nou ID hardware pentru a fi blocat:
The entered Hardware ID does not seem to be valid (must be at least 32 chars) Please, enter a valid Hardware ID = ID-ul hardware introdus pare a nu fi valid (trebuie să conţină cel puţin 32 caractere). Vă rugăm să introduceşi un ID hardware valid

File has a missing macro START or END. Please correct this error before protecting: = Fişierul nu conţine un macro START sau END. Vă rugăm să corectaţi această eroare înainte de protejare:
File has an invalid PE header. Unable to protect: = Fişierul conţine un header PE invalid. Nu poate fi protejat:
File contains one macro with few lines of code on it. Please review your macros before protecting: = Fişierul conţine macro-uri cu un număr mic de linii. Vă rugăm să revedeţi macro-urile înainte de protejare:
The input file seems to be in use. Please, close the file to proceed with protection: = Fişierul sursă pare a fi în folosire. Vă rugăm să închideţi fişierul înainte de a continua cu procesul de protejare:

Code Virtualization = Virtualizarea codului
Virtual Opcodes Obfuscation = Obfuscare OpCode virtual
Current: = Curent:
Virtual Machine Complexity = Complexitatea maşinii virtuale
Size (Approx): = Mărime (Aproximativ):
Opcodes Mutation = Mutaţii OpCode
Multiple Virtual Machines = Maşini virtuale multiple
NumVMs * SizeVM: = Număr VM * Mărime VM
Fake Stack Emulation = Emulare a stivei false
Strip Relocations (EXEs) = Îndepartare relocaţii (EXE)
Strip relocations = Îndepartare relocaţii
Re-Virtualization = Re-Virtualizare
Multi Branch Technology = Tehnologie multi branch
Fake Emulation = Emulare falsă
Keep original name = Păstrează numele original
Functions that will be virtualized: = Funcţii care vor fi virtualizate:

You can customize how complex will be the Virtual Machine opcodes. The size of the generated opcodes depend on the complexity selected = Puteţi optimiza cât de complexe vor fi OpCodes-urile maşinii virtuale. Mărimea OpCode-urilor depinde de complexitatea aleasă
You can customize how complex the generated virtual machine will be. The size of the virtual machine depends on the complexity that you select = Puteţi să alegeţi cât de complexă va fi maşina virtuală. Mărimea maşinii virtuale depinde de complexitatea pe care o alegeţi
You can mutate the internal virtual opcodes, generating a more complex virtual machine = Puteţi efectua mutaţii ale OpCode-urilor virtuale, pentru a genera maşini virtuale complexe
The generad Virtual Machine and virtual opcodes will be placed inside the last section of your application. You can rename the last section of your application as desired = Maşina virtuală generata şi OpCode-urile virtuale vor fi introduse în interiorul ultimei secţiuni. Puteţi redenumi ultima secţiune după cum doriţi.
You can create several Virtual Machines inside your protected application. Each Virtual Machine will process specific blocks of code in your application = Puteţi creea mai multe maşini virtuale în interiorul aplicaţiei protejate. Fiecare maşină virtuală va procesa părţi anume ale aplicaţiei
This option will assume the stack to be initilized to zero for all not allocated entries in stack. This option should be enabled for PureBasic applications = Această opţiune va presupune că stiva este iniţializată cu zero pentru toate înregistrările nealocate din stivă. Această opţiune ar trebui să fie bifată pentru aplicaţii PureBasic.
You can remove the relocations section from the PE header for EXE files, reducing the size of the final protected application = Puteţi 
Re-Virtualization is an extremely powerful technique against Reverse Engineering. But it can decrease a lot the performance in speed in the protected blocks.  Please, check the performance of your application when protected with Re-Virtualization = Re-virtualizarea este o tehnică extrem de puternică împotriva procesului de reverse engineering. Dar poate să scadă viteza de execuţie a unor blocuri de cod protejate.
This option will insert multiple conditional branch instructions inside your unique virtual machine, making it harder to analyse = Această opţiune va introduce multiple instrucţiuni de tip "conditional branch" în codul maşinii virtuale unice, pentru a o face mai dificilă de analizat

Please, select an application to protect = Vă rog să alegeţi aplicaţia care urmează a fi protejată
The selected application does not have any functions to virtualize. Please insert functions using the SDK = Aplicaţia aleasă nu conţine funcţii pentru virtualizare
All functions to virtualize were disabled. Please, select at least one = Toate funcţiile destinate virtualizării au fost dezactivate. Vă rog să alegeţi cel puţin una
Warning! A macro with no code inside has been found. This might be due to compiler optimizations. Please, disable your compiler optimizations or review each macro. = Atenţie! A fost identificat un macro fără cod. Aceasta ar putea fi cauzată de optimizări ale compilatorului. Vă rugăm să dezactivaţi optimizările compilatorului sau să revedeţi fiecare macro.
Virtual Functions = Funcţii virtuale
Inserted via "Call VarPtr": = Introduse prin "Apelare VarPtr":
Inserted via inline Assembly: = Introduse prin assembly inline:
Inserted via auxiliar API: = Introduse prin API auxiliar:
Inserted via MAP file: = Introduse prin fişier MAP
NO FUNCTIONS FOUND TO VIRTUALIZE!!! = NU AU FOST GĂSITE FUNCŢII DESTINATE VIRTUALIZĂRII !!!
(Application header has been rebuilt by Code Virtualizer) = (Header-ul aplicaţiei a fost reconstruit de Code Virtualizer)
Protecting an Application = Protejarea unei aplicaţii
Learn About Virtualizer = Citeşte despre Virtualizer
Code Virtualization = Virtualizarea codului
Code Virtualize Macros = Macro-uri pentru virtualizarea codului
**** Sorry, the DEMO version does not support protection via command line **** = *** Ne pare rău, această versiune DEMO nu suportă protecţia prin linie de comandă ***
*** ERROR: File to protect cannot be acccessed. (Exit code 2) *** = *** EROARE: Fişierul nu poate fi accesat. (Cod ieşire 2) ***
*** ERROR: File does not have any blocks to protect. (Exit code 3) *** = *** EROARE: Fişierul nu conţine blocuri destinate protejării. (Cod ieşire 3) ***
*** ERROR: File to protect cannot be opened. (Exit code 5) *** = *** EROARE: Fişierul nu poate fi deschis. (Cod ieşire 5) ***
Generating Specific Virtual Machine = Generez maşină virtuală unică
Virtualizing Function = Virtualizez funcţie
Re-Virtualizing ... = Re-virtualizare ...
Flushing file ... = Scriere fişier ...
Sorry, the DEMO version only allows one Virtual Machine per application = Ne pare rău, versiunea DEMO permite doar o singură maşină virtuală per aplicaţie
Sorry, the DEMO version does not support Re-Virtualization = Ne pare rău, versiunea DEMO nu suportă re-virtualizare
The application is already protected. You cannot protect an already protected application in the DEMO version = Această aplicaţie este deja protejată. Nu puteţi proteja o aplicaţie deja protejată în versiunea demonstrativă
The Input application cannot be accessed. Please, check that the application is not in use: = Fişierul sursă nu poate fi accesat. Vă rugăm să verificaţi dacă aplicaţia nu rulează în acest moment:
The Output application cannot be accessed. Please, check that the application path is valid or file is not in use: = Aplicaţia destinaţie nu poate fi accesată. Vă rugăm să verificaţi dacă destinaţia aplicaţiei este valabilă sau dacă aplicaţia nu rulează în acest moment:
Limitations in DEMO version: = Limitări în versiunea DEMO:
Virtual Opcodes Obfuscation set to NORMAL = Obfuscarea OpCode-urilor virtuale configurată la NORMAL
Virtual Machine Complexity set to NORMAL = Complexitatea maşinii virtuale configurată la NORMAL
Only ONE macro is virtualized = Doar UN macro este virtualizat
The Output application cannot be accessed. Please, check that the application is not in use: = Fişierul ieşire nu poate fi accesat. Vă rugăm să verificaţi dacă aplicaţia nu rulează în acest moment:
PE Information = Informaţii PE
Input PE file: = Fişier PE sursă:
Output PE file: = Fişier PE destinaţie:
Virtual Functions found: = Funcţii virtuale detectate:
PE file analysis... OK! = Analiza fişierului PE... OK!
Virtualization = Virtualizare
Generating Specific Virtual Machine = Generez maşină virtuală specifică
Size: = Mărime:
Virtualizing Function = Funcţie virtualizată
Start: = Start:
Skipped = Sărit
bytes = bytes
Cancelling... = Anulare...
Re-Virtualization = Re-Virtualizare
Re-Virtualizing ... = Re-Virtualizez ...
Final Stats = Statistici finale
Virtualized Functions: = Funcţii virtualizate:
Skipped Functions: = Funcţii sărite:
Errors: = Erori:
Increase in size: = Creştere în mărime:
Application successfully protected! = Aplicaţia a fost protejată cu succes!
Protection CANCELLED! = Protejare ANULATĂ!
Do you really want to Cancel the protection process? = Doriţi să anulaţi procesul de protejare?
Cancel Protection = Anulare protecţie


Anti-Debugger Detection = 
Advanced = 
Disable = 
Level 1 = 
Level 2 = 
File Patch (sign support) = 
Detect any change = 
Allow 1 hour back = 
Allow 1 day back = 
Allow clock changes = 
External Hardware = 
U3 USB device = 
(not Windows 9x/Me compatible) = 
Periodically check U3 device = 
The U3 USB device will be monitored to check if it's unplugged. The function WLHardwareRuntimeCheckU3 checks if the device is present or not at any time. = 
Checking U3 USB device = 
Network Instances: No more Allowed = 
Network Instances: Server not running = 
** Not available in current version ** = 
License installation time-limit exceeded = 
License disabled in current instance = 
Control Messages from external DLL = 
Select a DLL that will handle the displaying of each message. If no DLL is selected, Themida will display the above messages in a MessageBox =  
Functions Handlers = 
Select the function in your DLL that will handle the protection messages = 
Select the DLL that will handle all WinLicense events = 
Hide from PE scanners = 
Type 1 = 
Type 2 = 
Localization = 
Add Manifest = 
Don't add manifest = 
Add Custom manifest = 
MSVC80 manifest = 
XP Themes = 
MSVC90 manifest = 
Launch Application = 
This option will run an external application when the trial period in your application has expired. = 
Delete extracted on exit = 
Open Project = 
Description = 
Saved Projects = 
Date Created = 
Delete = 
Open = 
Reset Trial = 
Reset Trial in current machine = 
Search = 
Search Next = 
Install Before Date = 
Network Instances = 
Instances = 
Store Creation Date = 
Embed user info in key =  
(only for Dynamic SmartKeys) = 
Generate Dynamic SmartKey = 
Default License generation folder = 
License Restrictions = 
Miscellaneous = 
Search Details = 
Search by: = 
Search for: = 
Customer Name = 
GetPrivateProfile APIs support = 
